import type { TMessage } from './message/types';

export const messages: TMessage[] = [
  {
    id: '1',
    text: 'Привет! Как дела?',
    time: '19:30',
    isOwn: false,
    image: 'https://i.playground.ru/e/O64dJ9LZhncPt9m610mUvA.jpeg',
  },
  {
    id: '2',
    text: 'Привет! Всё отлично, спасибо 😊',
    time: '19:31',
    isOwn: true,
    image:
      'https://static.tildacdn.com/tild3163-3066-4534-b633-323361313535/image.png',
  },
  {
    id: '3',
    text: 'Слушай, а ты помнишь тот проект, который мы обсуждали на прошлой неделе?',
    time: '19:32',
    isOwn: false,
  },
  {
    id: '4',
    text: 'Конечно помню! Про мессенджер на TypeScript?',
    time: '19:32',
    isOwn: true,
  },
  {
    id: '5',
    text: 'Да, именно! Я тут подумал, может добавим голосовые сообщения?',
    time: '19:33',
    isOwn: false,
  },
  {
    id: '6',
    text: 'Крутая идея! 🔥 Но сначала бы основной функционал допилить',
    time: '19:33',
    isOwn: true,
  },
  {
    id: '7',
    text: 'Согласен, но представь как это будет выглядеть!',
    time: '19:34',
    isOwn: false,
  },
  {
    id: '8',
    text: 'Кстати, я уже начал делать компонент для сообщений',
    time: '19:35',
    isOwn: true,
  },
  {
    id: '9',
    text: 'Серьёзно? Покажешь?',
    time: '19:35',
    isOwn: false,
  },
  {
    id: '10',
    text: 'Конечно! Сейчас скину скриншот',
    time: '19:36',
    isOwn: true,
  },
  {
    id: '11',
    text: 'Wow! Выглядит очень профессионально 👏',
    time: '19:37',
    isOwn: false,
  },
  {
    id: '12',
    text: 'Спасибо! Использую Handlebars для шаблонов',
    time: '19:37',
    isOwn: true,
  },
  {
    id: '13',
    text: 'А компоненты как организованы?',
    time: '19:38',
    isOwn: false,
  },
  {
    id: '14',
    text: 'Классы с методами render() и attachEvents(). Очень удобно!',
    time: '19:39',
    isOwn: true,
  },
  {
    id: '15',
    text: 'Звучит как настоящий фреймворк 😄',
    time: '19:39',
    isOwn: false,
  },
  {
    id: '16',
    text: 'Ха-ха, да! Может назовём его MyFramework? 😂',
    time: '19:40',
    isOwn: true,
  },
  {
    id: '17',
    text: 'Лучше YandexFramework, раз для Яндекс.Практикума делаем',
    time: '19:40',
    isOwn: false,
  },
  {
    id: '18',
    text: 'Точно! 🎯 А завтра продолжим разработку?',
    time: '19:41',
    isOwn: true,
  },
  {
    id: '19',
    text: 'Обязательно! У меня есть идеи по поиску сообщений',
    time: '19:42',
    isOwn: false,
  },
  {
    id: '20',
    text: 'Отлично! До завтра тогда! 👋',
    time: '19:43',
    isOwn: true,
    image: 'https://www.sunhome.ru/i/wallpapers/241/afrikanskii-lev.orig.jpg',
  },
];
